Revit 2026 API

# CompoundStructureLayer Constructor

---

Creates a compound structure layer using default settings.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CompoundStructureLayer()
```
```vb
Public Sub New
```
```cpp
public:
CompoundStructureLayer()
```
```fsharp
new : unit -> CompoundStructureLayer
```

Note that the combination of the default values does not create a completely valid CompoundStructureLayer. You should change the necessary values before adding to a CompoundStructure.

#### Reference

CompoundStructureLayer Class

CompoundStructureLayer Overload

Autodesk.Revit.DB Namespace